NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_lmac.svd
        <register>
          <name>DIEPTSIZ15</name>
          <description>Device IN Endpoint Transfer Size Register 15</description>
          <addressOffset>0xAF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Transfer Size (XferSize)</description>
              <lsb>0</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet Count (PktCnt)</description>
              <lsb>19</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>MC</name>
              <description>MC</description>
              <lsb>29</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PACKETONE</name>
                  <description>1 packet</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKETTWO</name>
                  <description>2 packets</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKETTHREE</name>
                  <description>3 packets</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA15</name>
          <description>Device IN Endpoint DMA Address Register 15</description>
          <addressOffset>0xAF4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS15</name>
          <description>Device IN Endpoint Transmit FIFO Status Register 15</description>
          <addressOffset>0xAF8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000C00</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPTXFSPCAVAIL</name>
              <description>IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMAB15</name>
          <description>Device IN Endpoint Buffer Address Register 15</description>
          <addressOffset>0xAFC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMABUFFERADDR</name>
              <description>Holds the current buffer address.This register is updated as and when the data</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPCTL0</name>
          <description>Device Control OUT Endpoint 0 Control Register</description>
          <addressOffset>0xB00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYTE64</name>
                  <description>64 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE32</name>
                  <description>32 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE16</name>
                  <description>16 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE8</name>
                  <description>8 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>USB Active Endpoint 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK Status (NAKSts)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>The core is transmitting non-NAK handshakes based on the FIFO status</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>The core is transmitting NAK handshakes on this endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Endpoint Control 0</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Handshake (Stall)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Stall</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Stall Handshake</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK (CNAK)</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLEAR</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear NAK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK (SNAK)</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSET</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set NAK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Endpoint disable</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Enable Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPINT0</name>
          <description>Device OUT Endpoint 0 Interrupt Register</description>
          <addressOffset>0xB08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Transfer Complete Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Transfer Complete Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Endpoint Disabled Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Endpoint Disabled Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No AHB Error Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AHB Error interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETUP</name>
              <description>SETUP Phase Done (SetUp)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No SETUP Phase Done</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>SETUP Phase Done</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTTKNEPDIS</name>
              <description>OUT Token Received When Endpoint Disabled (OUTTknEPdis)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No OUT Token Received When Endpoint Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>OUT Token Received When Endpoint Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSPHSERCVD</name>
              <description>Status Phase Received for Control Write (StsPhseRcvd)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Status Phase Received for Control Write</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Status Phase Received for Control Write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BACK2BACKSETUP</name>
              <description>Back-to-Back SETUP Packets Received (Back2BackSETup)</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Back-to-Back SETUP Packets Received</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Back-to-Back SETUP Packets Received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPKTERR</name>
              <description>OUT Packet Error (OutPktErr)</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No OUT Packet Error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>OUT Packet Error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BNAINTR</name>
              <description>BNA (Buffer Not Available) Interrupt (BNAIntr)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No BNA interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>BNA interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet Drop Status (PktDrpSts)</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Packet Drop Status interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBLEERR</name>
              <description>NAK Interrupt (BbleErr)</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No BbleErr interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>BbleErr interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKINTRPT</name>
              <description>NAK Interrupt (NAKInterrupt)</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No NAK interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>NAK Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NYETINTRPT</name>
              <description>NYET Interrupt (NYETIntrpt)</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No NYET interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>NYET Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STUPPKTRCVD</name>
              <description>Setup Packet Received</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_RCVD</name>
                  <description>No Setup packet received</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RCVD</name>
                  <description>Setup packet received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTSIZ0</name>
          <description>Device OUT Endpoint 0 Transfer Size Register</description>
          <addressOffset>0xB10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Transfer Size (XferSize)</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet Count (PktCnt)</description>
              <lsb>19</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>SUPCNT</name>
              <description>SETUP Packet Count (SUPCnt)</description>
              <lsb>29</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONEPACKET</name>
                  <description>1 packet</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOPACKET</name>
                  <description>2 packets</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREEPACKET</name>
                  <description>3 packets</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPDMA0</name>
          <description>Device OUT Endpoint 0 DMA Address Register</description>
          <addressOffset>0xB14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPDMAB0</name>
          <description>Device OUT Endpoint 0 DMA Buffer Address Register</description>
          <addressOffset>0xB1C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMABUFFERADDR</name>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
