NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_lmac.svd
            <register>
              <name>ISR</name>
              <description>Interrupt Status Register</description>
              <addressOffset>0x030</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXEIS</name>
                  <description>Transmit FIFO Empty Interrupt Status</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txe_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txe_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXOIS</name>
                  <description>Transmit FIFO Overflow Interrupt Status</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txo_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txo_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXUIS</name>
                  <description>Receive FIFO Underflow Interrupt Status</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxu_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxu_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXOIS</name>
                  <description>Receive FIFO Overflow Interrupt Status</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxo_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxo_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXFIS</name>
                  <description>Receive FIFO Full Interrupt Status</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxf_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxf_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MSTIS</name>
                  <description>Multi-Controller Contention Interrupt Status. This bit field is not present</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_mst_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_mst_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDISR6</name>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDISR7</name>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDISR8</name>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVD9ISR</name>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPITES</name>
                  <description>SPI Transmit Error Interrupt</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_spite_intr interrupt is not active after masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_spite_intr interrupt is active after masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDISR11</name>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVD1231ISR</name>
                  <lsb>12</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RISR</name>
              <description>Raw Interrupt Status Register</description>
              <addressOffset>0x034</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXEIR</name>
                  <description>Transmit FIFO Empty Raw Interrupt Status</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txe_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txe_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXOIR</name>
                  <description>Transmit FIFO Overflow Raw Interrupt Status</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_txo_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_txo_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXUIR</name>
                  <description>Receive FIFO Underflow Raw Interrupt Status</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxu_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxu_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXOIR</name>
                  <description>Receive FIFO Overflow Raw Interrupt Status</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxo_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxo_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RXFIR</name>
                  <description>Receive FIFO Full Raw Interrupt Status</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_rxf_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_rxf_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MSTIR</name>
                  <description>Multi-Controller Contention Raw Interrupt Status. This bit field is not present if the MSPI CORE is configured as a serial-target device.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_mst_intr interrupt is not active prior masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_mst_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDRISR6</name>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRISR7</name>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRISR8</name>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVD9RISR</name>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SPITER</name>
                  <description>SPI Transmit Error Interrupt status.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>ssi_spite_intr interrupt is not active prior to masking</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>ssi_spite_intr interrupt is active prior to masking</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDRISR11</name>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVD1231RISR</name>
                  <lsb>12</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TXEICR</name>
              <description>Transmit FIFO Error Interrupt Clear Register Register</description>
              <addressOffset>0x038</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXEICR</name>
                  <description>Clear Transmit FIFO Overflow/Underflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDTXEICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RXOICR</name>
              <description>Receive FIFO Overflow Interrupt Clear Register</description>
              <addressOffset>0x03C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXOICR</name>
                  <description>Clear Receive FIFO Overflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRXOICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RXUICR</name>
              <description>Receive FIFO Underflow Interrupt Clear Register</description>
              <addressOffset>0x040</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXUICR</name>
                  <description>Clear Receive FIFO Underflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRXUICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MSTICR</name>
              <description>Multi-Controller Interrupt Clear Register</description>
              <addressOffset>0x044</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MSTICR</name>
                  <description>Clear Multi-Controller Contention Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDMSTICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>ICR</name>
              <description>Interrupt Clear Register</description>
              <addressOffset>0x048</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ICR</name>
                  <description>Clear Interrupts.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDICR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMACR</name>
              <description>DMA Control Register</description>
              <addressOffset>0x04C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RDMAE</name>
                  <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Receive DMA disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Receive DMA enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TDMAE</name>
                  <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Transmit DMA disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Transmit DMA enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDDMACR2</name>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR34</name>
                  <lsb>3</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR5</name>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR6</name>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR7</name>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR811</name>
                  <lsb>8</lsb>
                  <msb>11</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR1214</name>
                  <lsb>12</lsb>
                  <msb>14</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDDMACR</name>
                  <lsb>15</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
